torbrodtkorb/alva-master/firmware/pack/edc/AVR64DA48.PIC
        <edc:SFRDef ltx:memberofperipheral="PORTMUX" edc:cname="ZCDROUTEA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x5EA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="ZCD0" edc:nzwidth="0x1" edc:desc="Zero Cross Detector 0 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC7" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ZCD1" edc:nzwidth="0x1" edc:desc="Zero Cross Detector 1 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC7" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x15" edc:_addr="0x5EB"/>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="n-nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xBF" edc:_addr="0x600">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ADC Enable"/>
              <edc:SFRFieldDef edc:cname="FREERUN" edc:nzwidth="0x1" edc:desc="Free running mode"/>
              <edc:SFRFieldDef edc:cname="RESSEL" edc:nzwidth="0x2" edc:desc="Resolution selection">
                <edc:SFRFieldSemantic edc:cname="12BIT" edc:desc="12-bit mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="10BIT" edc:desc="10-bit mode" edc:when="(field &amp; 0x3) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left adjust result"/>
              <edc:SFRFieldDef edc:cname="CONVMODE" edc:nzwidth="0x1" edc:desc="Conversion mode">
                <edc:SFRFieldSemantic edc:cname="SINGLEENDED" edc:desc="Single-Ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Differential mode" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTBY" edc:nzwidth="0x1" edc:desc="Run standby mode"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x601">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="SAMPNUM" edc:nzwidth="0x3" edc:desc="Accumulation Samples">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No accumulation" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ACC2" edc:desc="2 results accumulated" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ACC4" edc:desc="4 results accumulated" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ACC8" edc:desc="8 results accumulated" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ACC16" edc:desc="16 results accumulated" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ACC32" edc:desc="32 results accumulated" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ACC64" edc:desc="64 results accumulated" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="ACC128" edc:desc="128 results accumulated" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLC" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x602">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x4" edc:desc="Clock Pre-scaler">
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_PER divided by 2" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_PER divided by 4" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_PER divided by 8" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIV12" edc:desc="CLK_PER divided by 12" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_PER divided by 16" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DIV20" edc:desc="CLK_PER divided by 20" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="DIV24" edc:desc="CLK_PER divided by 24" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="DIV28" edc:desc="CLK_PER divided by 28" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_PER divided by 32" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="DIV48" edc:desc="CLK_PER divided by 48" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_PER divided by 64" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="DIV96" edc:desc="CLK_PER divided by 96" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_PER divided by 128" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_PER divided by 256" edc:when="(field &amp; 0xF) == 0x0D"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLD" edc:nzwidth="0x8" edc:access="nnn-nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xEF" edc:_addr="0x603">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="SAMPDLY" edc:nzwidth="0x4" edc:desc="Sampling Delay Selection">
                <edc:SFRFieldSemantic edc:cname="DLY0" edc:desc="Delay 0 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DLY1" edc:desc="Delay 1 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DLY2" edc:desc="Delay 2 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DLY3" edc:desc="Delay 3 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DLY4" edc:desc="Delay 4 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DLY5" edc:desc="Delay 5 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="DLY6" edc:desc="Delay 6 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="DLY7" edc:desc="Delay 7 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="DLY8" edc:desc="Delay 8 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="DLY9" edc:desc="Delay 9 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="DLY10" edc:desc="Delay 10 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="DLY11" edc:desc="Delay 11 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="DLY12" edc:desc="Delay 12 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="DLY13" edc:desc="Delay 13 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="DLY14" edc:desc="Delay 14 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="DLY15" edc:desc="Delay 15 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="INITDLY" edc:nzwidth="0x3" edc:desc="Initial Delay Selection">
                <edc:SFRFieldSemantic edc:cname="DLY0" edc:desc="Delay 0 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DLY16" edc:desc="Delay 16 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DLY32" edc:desc="Delay 32 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DLY64" edc:desc="Delay 64 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DLY128" edc:desc="Delay 128 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DLY256" edc:desc="Delay 256 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLE" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x604">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="WINCM" edc:nzwidth="0x3" edc:desc="Window Comparator Mode">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Window Comparison" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Below Window" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Above Window" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Inside Window" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="OUTSIDE" edc:desc="Outside Window" edc:when="(field &amp; 0x7) == 0x04"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="SAMPCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x605">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="SAMPLEN" edc:nzwidth="0x8" edc:desc="Sample lenght"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x606"/>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="MUXPOS" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x608">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x7" edc:desc="Analog Channel Selection Bits">
                <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="ADC input pin 0" edc:when="(field &amp; 0x7F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC input pin 1" edc:when="(field &amp; 0x7F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC input pin 2" edc:when="(field &amp; 0x7F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC input pin 3" edc:when="(field &amp; 0x7F) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC input pin 4" edc:when="(field &amp; 0x7F) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC input pin 5" edc:when="(field &amp; 0x7F) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="ADC input pin 6" edc:when="(field &amp; 0x7F) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="ADC input pin 7" edc:when="(field &amp; 0x7F) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="AIN8" edc:desc="ADC input pin 8" edc:when="(field &amp; 0x7F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="AIN9" edc:desc="ADC input pin 9" edc:when="(field &amp; 0x7F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="AIN10" edc:desc="ADC input pin 10" edc:when="(field &amp; 0x7F) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="AIN11" edc:desc="ADC input pin 11" edc:when="(field &amp; 0x7F) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="AIN16" edc:desc="ADC input pin 16" edc:when="(field &amp; 0x7F) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="AIN17" edc:desc="ADC input pin 17" edc:when="(field &amp; 0x7F) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="AIN18" edc:desc="ADC input pin 18" edc:when="(field &amp; 0x7F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="AIN19" edc:desc="ADC input pin 19" edc:when="(field &amp; 0x7F) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="AIN20" edc:desc="ADC input pin 20" edc:when="(field &amp; 0x7F) == 0x14"/>
                <edc:SFRFieldSemantic edc:cname="AIN21" edc:desc="ADC input pin 21" edc:when="(field &amp; 0x7F) == 0x15"/>
                <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7F) == 0x40"/>
                <edc:SFRFieldSemantic edc:cname="TEMPSENSE" edc:desc="Temperature sensor" edc:when="(field &amp; 0x7F) == 0x42"/>
                <edc:SFRFieldSemantic edc:cname="DAC0" edc:desc="DAC0" edc:when="(field &amp; 0x7F) == 0x48"/>
                <edc:SFRFieldSemantic edc:cname="DACREF0" edc:desc="DACREF0" edc:when="(field &amp; 0x7F) == 0x49"/>
                <edc:SFRFieldSemantic edc:cname="DACREF1" edc:desc="DACREF1" edc:when="(field &amp; 0x7F) == 0x4A"/>
                <edc:SFRFieldSemantic edc:cname="DACREF2" edc:desc="DACREF2" edc:when="(field &amp; 0x7F) == 0x4B"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
