torbrodtkorb/alva-master/firmware/pack/edc/AVR64DA48.PIC
        <edc:SFRDef ltx:memberofperipheral="AC2" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="nn-n---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD1" edc:_addr="0x697">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC2">
              <edc:SFRFieldDef edc:cname="CMPIF" edc:nzwidth="0x1" edc:desc="Analog Comparator Interrupt Flag"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CMPSTATE" edc:nzwidth="0x1" edc:desc="Analog Comparator State"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="WINSTATE" edc:nzwidth="0x2" edc:desc="Analog Comparator Window State">
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Above window" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Inside window" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Below window" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x698"/>
        <edc:SFRDef ltx:memberofperipheral="DAC0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="nn-----n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xC1" edc:_addr="0x6A0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DAC Enable"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="OUTEN" edc:nzwidth="0x1" edc:desc="Output Buffer Enable"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby Mode"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x6A1"/>
        <edc:SFRDef ltx:memberofperipheral="DAC0" edc:cname="DATA" edc:nzwidth="0x10" edc:access="nnnnnnnnnn------" edc:impl="0xFFC0" edc:_addr="0x6A2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0xA" edc:desc="Data"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x6A4"/>
        <edc:SFRDef ltx:memberofperipheral="ZCD0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="nn--n--n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xC9" edc:_addr="0x6C0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ZCD0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="INVERT" edc:nzwidth="0x1" edc:desc="Invert signal from pin"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="OUTEN" edc:nzwidth="0x1" edc:desc="Output Pad Enable"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby Mode"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x6C1"/>
        <edc:SFRDef ltx:memberofperipheral="ZCD0" edc:cname="INTCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x6C2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ZCD0">
              <edc:SFRFieldDef edc:cname="INTMODE" edc:nzwidth="0x2" edc:desc="Interrupt Mode">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No interrupt" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Interrupt on rising input signal" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Interrupt on falling input signal" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Interrupt on both rising and falling input signal" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ZCD0" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="---n---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x11" edc:_addr="0x6C3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ZCD0">
              <edc:SFRFieldDef edc:cname="CROSSIF" edc:nzwidth="0x1" edc:desc="ZCD Interrupt Flag"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="STATE" edc:nzwidth="0x1" edc:desc="ZCD State">
                <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Output is 0" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Output is 1" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x6C4"/>
        <edc:SFRDef ltx:memberofperipheral="ZCD1" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="nn--n--n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xC9" edc:_addr="0x6C8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ZCD1">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="INVERT" edc:nzwidth="0x1" edc:desc="Invert signal from pin"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="OUTEN" edc:nzwidth="0x1" edc:desc="Output Pad Enable"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby Mode"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x6C9"/>
        <edc:SFRDef ltx:memberofperipheral="ZCD1" edc:cname="INTCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x6CA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ZCD1">
              <edc:SFRFieldDef edc:cname="INTMODE" edc:nzwidth="0x2" edc:desc="Interrupt Mode">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No interrupt" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Interrupt on rising input signal" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Interrupt on falling input signal" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Interrupt on both rising and falling input signal" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ZCD1" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="---n---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x11" edc:_addr="0x6CB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ZCD1">
              <edc:SFRFieldDef edc:cname="CROSSIF" edc:nzwidth="0x1" edc:desc="ZCD Interrupt Flag"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="STATE" edc:nzwidth="0x1" edc:desc="ZCD State">
                <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Output is 0" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Output is 1" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
